<a href="https://colab.research.google.com/github/Anuja-F/ineuron-Assignments/blob/master/datacleanngassgn.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**It happens all the time: someone gives you data containing malformed strings,Python, lists and missing data. How do you tidy it up so you can get on with the analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:**

In [18]:
import pandas as pd
import numpy as np

In [55]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [56]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

**1.Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).**

In [57]:
for i in range(1,len(df)):
  if pd.isnull(df.loc[i,"FlightNumber"]):
    df.loc[i,"FlightNumber"]= df.loc[i-1,"FlightNumber"]+10
  
df["FlightNumber"] = df["FlightNumber"].astype(int)  
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

**2.The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.**

In [58]:
temporarydf = df.copy()
temporarydf[["From","To"]] = temporarydf["From_To"].str.split("_",expand=True)
temporarydf

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris         10045  ...    LoNDon      paris
1      MAdrid_miLAN         10055  ...    MAdrid      miLAN
2  londON_StockhOlm         10065  ...    londON  StockhOlm
3    Budapest_PaRis         10075  ...  Budapest      PaRis
4   Brussels_londOn         10085  ...  Brussels     londOn

[5 rows x 6 columns]

**3.Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)**

In [59]:
temporarydf["From_To"]

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [60]:
temporarydf["From_To"] = temporarydf["From_To"].str.capitalize()
temporarydf["From"] = temporarydf["From"].str.capitalize()
temporarydf["To"] = temporarydf["To"].str.capitalize()
temporarydf

            From_To  FlightNumber  ...      From         To
0      London_paris         10045  ...    London      Paris
1      Madrid_milan         10055  ...    Madrid      Milan
2  London_stockholm         10065  ...    London  Stockholm
3    Budapest_paris         10075  ...  Budapest      Paris
4   Brussels_london         10085  ...  Brussels     London

[5 rows x 6 columns]

**4.Delete the From_To column from df and attach the temporary DataFrame
from the previous questions**

In [61]:
df.drop("From_To",axis=1,inplace=True)
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [62]:
df["From_To"] = temporarydf["From_To"]

df["From"] = temporarydf["From"]
df["To"] =temporarydf["To"]
df

   FlightNumber  RecentDelays  ...      From         To
0         10045      [23, 47]  ...    London      Paris
1         10055            []  ...    Madrid      Milan
2         10065  [24, 43, 87]  ...    London  Stockholm
3         10075          [13]  ...  Budapest      Paris
4         10085      [67, 32]  ...  Brussels     London

[5 rows x 6 columns]

**5.In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column,each
second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.**
**Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.**

In [63]:

temp = pd.DataFrame(df["RecentDelays"].values.tolist())
temp

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [64]:
length = temp.shape[1]
length

3

In [65]:
cols=[]
for i in range(length):
  cols.append("Delay_"+str(i))

temp = pd.DataFrame(df["RecentDelays"].values.tolist(),columns=cols)
temp

   Delay_0  Delay_1  Delay_2
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [66]:
df.drop("RecentDelays",axis=1,inplace=True)
df[cols] = temp[cols]
df

   FlightNumber              Airline  ... Delay_1 Delay_2
0         10045               KLM(!)  ...    47.0     NaN
1         10055    <Air France> (12)  ...     NaN     NaN
2         10065  (British Airways. )  ...    43.0    87.0
3         10075       12. Air France  ...     NaN     NaN
4         10085          "Swiss Air"  ...    32.0     NaN

[5 rows x 8 columns]